Pandas Part2: DataFrame(약어-DF)

In [74]:
import pandas as pd
import numpy as np

자료만 입력& 컬럼이름 생성

In [75]:
d=[0,1,2,3,4]
df = pd.DataFrame(d)
print(df)
print("-----------")
ds = pd.Series(d)
print(ds)

   0
0  0
1  1
2  2
3  3
4  4
-----------
0    0
1    1
2    2
3    3
4    4
dtype: int64

In [76]:
df.values

array([[0],
       [1],
       [2],
       [3],
       [4]], dtype=int64)

In [77]:
#DataFrame
d=[0,1,2,3,4]
df = pd.DataFrame(d)
print(df)
print("-----------")
df.columns = ["column1"]#내가 만든 세로줄 인덱스!
print(df)

   0
0  0
1  1
2  2
3  3
4  4
-----------
   column1
0        0
1        1
2        2
3        3
4        4

컬럼 추가하면서 데이터 입력

In [78]:
df["newCol"]=d
print(df)
print("---------------------------")
df["newCol2"]=5
print(df)

   column1  newCol
0        0       0
1        1       1
2        2       2
3        3       3
4        4       4
---------------------------
   column1  newCol  newCol2
0        0       0        5
1        1       1        5
2        2       2        5
3        3       3        5
4        4       4        5

In [79]:
df["newCol"]

0    0
1    1
2    2
3    3
4    4
Name: newCol, dtype: int64

아래의 2가지 문제에 대해서 해결하세요!->numpy,pandas에 기본적인 특징을 고민하면 쉽게 해결이 가능합 -> "일괄적용"부분

Q1)df에서 newCol3을 기존의 newCol2의 값을 기준으로 만들고, 기존의 newCol2의 모든 값을 100배한 값을 newCol3에 생성

Q2) df에서 newCol2에서 2번째 값을 확인(5)하고, 이 값을 2000으로 변경하기

In [80]:
df["newCol3"]=df["newCol2"]*100
df["newCol3"]

0    500
1    500
2    500
3    500
4    500
Name: newCol3, dtype: int64

In [81]:
#내가 한 답
df["newCol2"][1]=2000

In [82]:
#쌤 답
df.iat[1,2]=2000

In [83]:
df

   column1  newCol  newCol2  newCol3
0        0       0        5      500
1        1       1     2000      500
2        2       2        5      500
3        3       3        5      500
4        4       4        5      500

In [84]:
df.columns

Index(['column1', 'newCol', 'newCol2', 'newCol3'], dtype='object')

In [85]:
del df["newCol"]
df

   column1  newCol2  newCol3
0        0        5      500
1        1     2000      500
2        2        5      500
3        3        5      500
4        4        5      500

In [86]:
df

   column1  newCol2  newCol3
0        0        5      500
1        1     2000      500
2        2        5      500
3        3        5      500
4        4        5      500

In [87]:
#보이는 효과
#가로줄= axis=0, 세로줄=axis=1

df.drop("newCol2", axis=1)

   column1  newCol3
0        0      500
1        1      500
2        2      500
3        3      500
4        4      500

In [88]:
#실제 drop 업데이트 =>df=해야함
df=df.drop("newCol2", axis=1)
df

   column1  newCol3
0        0      500
1        1      500
2        2      500
3        3      500
4        4      500

In [89]:
df.drop(3, axis=0)

   column1  newCol3
0        0      500
1        1      500
2        2      500
4        4      500

In [90]:
#가로줄 인덱스
df.index

RangeIndex(start=0, stop=5, step=1)

In [91]:
#세로줄 인덱스
df.columns

Index(['column1', 'newCol3'], dtype='object')

In [92]:
df.index.name="Count"
df

       column1  newCol3
Count
0            0      500
1            1      500
2            2      500
3            3      500
4            4      500

변수이름=pd.DataFrame(값=[,,,] , index=[,,,] )

In [93]:
stock_price_DF_withIndex = pd.DataFrame(
    [10000,10300,9900,10500,11000],
    index = ["2020-03-01","2020-03-02","2020-03-03","2020-03-04","2020-03-5"])
stock_price_DF_withIndex

                0
2020-03-01  10000
2020-03-02  10300
2020-03-03   9900
2020-03-04  10500
2020-03-5   11000

In [94]:
stock_price_DF_withIndex.rename(columns = {0:"시가"}, inplace=True)
stock_price_DF_withIndex

               시가
2020-03-01  10000
2020-03-02  10300
2020-03-03   9900
2020-03-04  10500
2020-03-5   11000

In [95]:
stock_price_DF_withIndex.rename(columns = {"시가2":"시가"}, inplace=True)
stock_price_DF_withIndex

               시가
2020-03-01  10000
2020-03-02  10300
2020-03-03   9900
2020-03-04  10500
2020-03-5   11000

In [96]:
stock_price_DF_withIndex["종가"]=[11000,12000,10000,13000,12000]
stock_price_DF_withIndex

               시가     종가
2020-03-01  10000  11000
2020-03-02  10300  12000
2020-03-03   9900  10000
2020-03-04  10500  13000
2020-03-5   11000  12000

In [97]:
stock_price_DF_withIndex["고가"]=[13000,15000,15000,18000,17000]
stock_price_DF_withIndex

               시가     종가     고가
2020-03-01  10000  11000  13000
2020-03-02  10300  12000  15000
2020-03-03   9900  10000  15000
2020-03-04  10500  13000  18000
2020-03-5   11000  12000  17000

In [98]:
stock_price_DF_withIndex["저가"]=[3000,5000,5000,8000,7000]
stock_price_DF_withIndex

               시가     종가     고가    저가
2020-03-01  10000  11000  13000  3000
2020-03-02  10300  12000  15000  5000
2020-03-03   9900  10000  15000  5000
2020-03-04  10500  13000  18000  8000
2020-03-5   11000  12000  17000  7000

In [99]:
stock_price_DF_withIndex = pd.DataFrame(
    [10000,10300,9900,10500,11000],
    index = ["2020-03-01","2020-03-02","2020-03-03","2020-03-04","2020-03-5"])

stock_price_DF_withIndex.rename(columns = {0:"시가"}, inplace=True)

stock_price_DF_withIndex["종가"]=[11000,12000,10000,13000,12000]
stock_price_DF_withIndex["고가"]=[13000,15000,15000,18000,17000]
stock_price_DF_withIndex["저가"]=[3000,5000,5000,8000,7000]

stock_price_DF_withIndex

               시가     종가     고가    저가
2020-03-01  10000  11000  13000  3000
2020-03-02  10300  12000  15000  5000
2020-03-03   9900  10000  15000  5000
2020-03-04  10500  13000  18000  8000
2020-03-5   11000  12000  17000  7000

In [100]:
stock_price_DF_withIndex.iat[0,0]

10000

*Q) 2020년 3월 1일의 시가/종가를 출력해보세요                    
*Q) 2020년 3월 1일에서 2020년 03월03일의 시가/종가/고가/저가를 출력해보세요

In [101]:
stock_price_DF_withIndex.iloc[0,0:2]

시가    10000
종가    11000
Name: 2020-03-01, dtype: int64

In [102]:
stock_price_DF_withIndex.iloc[0:3,:]

               시가     종가     고가    저가
2020-03-01  10000  11000  13000  3000
2020-03-02  10300  12000  15000  5000
2020-03-03   9900  10000  15000  5000

In [103]:
stock_price_DF_withIndex.loc["2020-03-01",["시가","종가"]]

시가    10000
종가    11000
Name: 2020-03-01, dtype: int64

In [104]:
stock_price_DF_withIndex.loc["2020-03-01":"2020-03-03",:]

               시가     종가     고가    저가
2020-03-01  10000  11000  13000  3000
2020-03-02  10300  12000  15000  5000
2020-03-03   9900  10000  15000  5000

In [105]:
stock_price_DF_withIndex[["시가","고가"]]

               시가     고가
2020-03-01  10000  13000
2020-03-02  10300  15000
2020-03-03   9900  15000
2020-03-04  10500  18000
2020-03-5   11000  17000

In [106]:
stock_price_DF_withIndex

               시가     종가     고가    저가
2020-03-01  10000  11000  13000  3000
2020-03-02  10300  12000  15000  5000
2020-03-03   9900  10000  15000  5000
2020-03-04  10500  13000  18000  8000
2020-03-5   11000  12000  17000  7000

In [107]:
stock_price_DF_withIndex.shape  #=>튜플 형태로 출력

(5, 4)

In [108]:
#가로가 몇개냐
stock_price_DF_withIndex.shape[0]

5

In [109]:
#세로가 몇개냐
stock_price_DF_withIndex.shape[1]

4

In [110]:
stock_price_DF_withIndex.values  #=>넘파이 어레이 형태로 톨력

array([[10000, 11000, 13000,  3000],
       [10300, 12000, 15000,  5000],
       [ 9900, 10000, 15000,  5000],
       [10500, 13000, 18000,  8000],
       [11000, 12000, 17000,  7000]], dtype=int64)

In [111]:
stock_price_DF_withIndex.ndim

2

reindex: 인덱스 변경시

In [112]:
obj = pd.Series([4.5, 7.2, -5.3], index=["c","b","a"])
obj

c    4.5
b    7.2
a   -5.3
dtype: float64

In [113]:
obj.reindex(["a","d","e","c","b"]).interpolate() #interpolate:앞뒤 데이터 바탕으로 계산하여 데이터가 채워짐

a   -5.300000
d   -2.033333
e    1.233333
c    4.500000
b    7.200000
dtype: float64

In [114]:
obj2= obj.reindex(["a","b","c","d","e"],fill_value=0) #fill_value:값이 없는 곳은'특정한 값'으로 채워주세요
obj2

a   -5.3
b    7.2
c    4.5
d    0.0
e    0.0
dtype: float64

sort

In [115]:
stock_price_DF_withIndex.sort_index(axis=1, ascending=True)

               고가     시가    저가     종가
2020-03-01  13000  10000  3000  11000
2020-03-02  15000  10300  5000  12000
2020-03-03  15000   9900  5000  10000
2020-03-04  18000  10500  8000  13000
2020-03-5   17000  11000  7000  12000

In [116]:
stock_price_DF_withIndex.sort_index(axis=0, ascending=False)

               시가     종가     고가    저가
2020-03-5   11000  12000  17000  7000
2020-03-04  10500  13000  18000  8000
2020-03-03   9900  10000  15000  5000
2020-03-02  10300  12000  15000  5000
2020-03-01  10000  11000  13000  3000

In [117]:
#sort한 결과도 data frame이기때문에, 그거에 이어서 sort하면 됨.

stock_price_DF_withIndex.sort_index(axis=1, ascending=False).sort_index(axis=0, ascending=False)

               종가    저가     시가     고가
2020-03-5   12000  7000  11000  17000
2020-03-04  13000  8000  10500  18000
2020-03-03  10000  5000   9900  15000
2020-03-02  12000  5000  10300  15000
2020-03-01  11000  3000  10000  13000

In [118]:
#특정컬럼 값 기준 sort
stock_price_DF_withIndex.sort_values(by=["고가"],ascending=False)

               시가     종가     고가    저가
2020-03-04  10500  13000  18000  8000
2020-03-5   11000  12000  17000  7000
2020-03-02  10300  12000  15000  5000
2020-03-03   9900  10000  15000  5000
2020-03-01  10000  11000  13000  3000

In [119]:
#기준이 여러가지 일때, 앞에 있는 기준이 우선
stock_price_DF_withIndex.sort_values(by=["고가","종가"],ascending=False)

               시가     종가     고가    저가
2020-03-04  10500  13000  18000  8000
2020-03-5   11000  12000  17000  7000
2020-03-02  10300  12000  15000  5000
2020-03-03   9900  10000  15000  5000
2020-03-01  10000  11000  13000  3000

Pandas자료구조 - DateFrame/Series-apply&lambda(일괄적용)

In [120]:
stock_price_DF_withIndex

               시가     종가     고가    저가
2020-03-01  10000  11000  13000  3000
2020-03-02  10300  12000  15000  5000
2020-03-03   9900  10000  15000  5000
2020-03-04  10500  13000  18000  8000
2020-03-5   11000  12000  17000  7000

In [121]:
#어떤 한줄에 대해 진행(줄=x)
stock_price_DF_withIndex.apply(lambda x: x.max() - x.min(), axis=1) #모든 aixs=1(세로)값을 보고자함

2020-03-01    10000
2020-03-02    10000
2020-03-03    10000
2020-03-04    10000
2020-03-5     10000
dtype: int64

In [122]:
#각 셀에 대해 진행(셀=x)
stock_price_DF_withIndex.applymap(lambda x: x+100)

               시가     종가     고가    저가
2020-03-01  10100  11100  13100  3100
2020-03-02  10400  12100  15100  5100
2020-03-03  10000  10100  15100  5100
2020-03-04  10600  13100  18100  8100
2020-03-5   11100  12100  17100  7100

In [123]:
stock_price_DF_withIndex["GAP"]= stock_price_DF_withIndex.apply(lambda x : x.max()-x.min(), axis=1)
stock_price_DF_withIndex

               시가     종가     고가    저가    GAP
2020-03-01  10000  11000  13000  3000  10000
2020-03-02  10300  12000  15000  5000  10000
2020-03-03   9900  10000  15000  5000  10000
2020-03-04  10500  13000  18000  8000  10000
2020-03-5   11000  12000  17000  7000  10000

Q)for문으로 해보기

In [124]:
stock_price_DF_withIndex = pd.DataFrame(
    [10000,10300,9900,10500,11000],
    index = ["2020-03-01","2020-03-02","2020-03-03","2020-03-04","2020-03-5"])

stock_price_DF_withIndex.rename(columns = {0:"시가"}, inplace=True)

stock_price_DF_withIndex["종가"]=[11000,12000,10000,13000,12000]
stock_price_DF_withIndex["고가"]=[13000,15000,15000,18000,17000]
stock_price_DF_withIndex["저가"]=[3000,6000,5000,6000,4000]

stock_price_DF_withIndex["GAP"]= stock_price_DF_withIndex.apply(lambda x : x.max()-x.min(), axis=1)

stock_price_DF_withIndex

               시가     종가     고가    저가    GAP
2020-03-01  10000  11000  13000  3000  10000
2020-03-02  10300  12000  15000  6000   9000
2020-03-03   9900  10000  15000  5000  10000
2020-03-04  10500  13000  18000  6000  12000
2020-03-5   11000  12000  17000  4000  13000

In [125]:
#가로줄 기준
len(stock_price_DF_withIndex)

5

In [126]:
stock_price_DF_withIndex.shape[0]

5

In [127]:
stock_price_DF_withIndex["Gap_forloop"]=0

for i in range(0,len(stock_price_DF_withIndex)):
    
    stock_price_DF_withIndex["Gap_forloop"][i]= stock_price_DF_withIndex.iloc[i,0:4].max()-stock_price_DF_withIndex.iloc[i,0:4].min()
    #stock_price_DF_withIndex[i,5]=
stock_price_DF_withIndex

               시가     종가     고가    저가    GAP  Gap_forloop
2020-03-01  10000  11000  13000  3000  10000        10000
2020-03-02  10300  12000  15000  6000   9000         9000
2020-03-03   9900  10000  15000  5000  10000        10000
2020-03-04  10500  13000  18000  6000  12000        12000
2020-03-5   11000  12000  17000  4000  13000        13000

In [128]:
stock_price_DF_withIndex.iloc[0,[0,1,4]]

시가     10000
종가     11000
GAP    10000
Name: 2020-03-01, dtype: int64

In [129]:
labels = ["Gap_forloop"]
labels_idx = [stock_price_DF_withIndex.columns.get_loc(i) for i in labels]
labels_idx

[5]

In [130]:
labels_idx[0]

5

In [131]:
stock_price_DF_withIndex["Gap_forloop"]=0

labels = ["Gap_forloop"]
labels_idx = [stock_price_DF_withIndex.columns.get_loc(i) for i in labels]
cols = ["시가","종가","저가","고가"]
cols_idx = [stock_price_DF_withIndex.columns.get_loc(i) for i in cols]

for i in range(0,len(stock_price_DF_withIndex)):
    temp = stock_price_DF_withIndex.iloc[i, cols_idx]
    stock_price_DF_withIndex.iat[i, labels_idx[0]]=temp.max()-temp.min()
stock_price_DF_withIndex

               시가     종가     고가    저가    GAP  Gap_forloop
2020-03-01  10000  11000  13000  3000  10000        10000
2020-03-02  10300  12000  15000  6000   9000         9000
2020-03-03   9900  10000  15000  5000  10000        10000
2020-03-04  10500  13000  18000  6000  12000        12000
2020-03-5   11000  12000  17000  4000  13000        13000

In [132]:
stock_price_DF_withIndex.columns

Index(['시가', '종가', '고가', '저가', 'GAP', 'Gap_forloop'], dtype='object')

In [133]:
#종가가 있는 컬럼 인덱스를 알려줘라=> .column.get_loc(" ")
stock_price_DF_withIndex.columns.get_loc("종가")

1

In [134]:
labels = ["시가","고가","종가"]

labels_idx = [stock_price_DF_withIndex.columns.get_loc(label) for label in labels]
labels_idx

[0, 2, 1]

In [135]:
stock_price_DF_withIndex["Gap_forloop2"]=0
stock_price_DF_withIndex

               시가     종가     고가    저가    GAP  Gap_forloop  Gap_forloop2
2020-03-01  10000  11000  13000  3000  10000        10000             0
2020-03-02  10300  12000  15000  6000   9000         9000             0
2020-03-03   9900  10000  15000  5000  10000        10000             0
2020-03-04  10500  13000  18000  6000  12000        12000             0
2020-03-5   11000  12000  17000  4000  13000        13000             0

In [136]:
for i in stock_price_DF_withIndex.index:
    temp = stock_price_DF_withIndex.loc[i,["시가","종가","고가","저가"]]
    gap = temp.max() - temp.min()
    stock_price_DF_withIndex.at[i,"Gap_forloop2"]=gap
stock_price_DF_withIndex

               시가     종가     고가    저가    GAP  Gap_forloop  Gap_forloop2
2020-03-01  10000  11000  13000  3000  10000        10000         10000
2020-03-02  10300  12000  15000  6000   9000         9000          9000
2020-03-03   9900  10000  15000  5000  10000        10000         10000
2020-03-04  10500  13000  18000  6000  12000        12000         12000
2020-03-5   11000  12000  17000  4000  13000        13000         13000

In [137]:
stock_price_DF_withIndex.loc[:,["시가","종가","고가","저가"]].apply(lambda x: x.mean(), axis=0)

시가    10340.0
종가    11600.0
고가    15600.0
저가     4800.0
dtype: float64

In [138]:
#간단한 통계관련 부분
data={'name':['Jason','Molly','Tina','Jake','Amy'],
     'age': [42,52,36,24,73],
     'preTestScore':[4,24,31,2,3],
     'postTestScore':[25,94,57,62,70]}
df=pd.DataFrame(data, columns = ['name','age','preTestScore','postTestScore'])
df

    name  age  preTestScore  postTestScore
0  Jason   42             4             25
1  Molly   52            24             94
2   Tina   36            31             57
3   Jake   24             2             62
4    Amy   73             3             70

In [139]:
#간단한 통계관련 부분-sum/mean/consum(누적함계)...
print(df['age'].sum())
print(df['preTestScore'].mean())
print(df['preTestScore'].cumsum())
print(df['preTestScore'].describe())

print(df['preTestScore'].var())
print(df['preTestScore'].std())
print(df['preTestScore'].skew())#한쪽으로 얼마나 쏠려있는지 확인하는 기능

227
12.8
0     4
1    28
2    59
3    61
4    64
Name: preTestScore, dtype: int64
count     5.000000
mean     12.800000
std      13.663821
min       2.000000
25%       3.000000
50%       4.000000
75%      24.000000
max      31.000000
Name: preTestScore, dtype: float64
186.7
13.663820841916802
0.7433452457326751

In [140]:
#상관계수(각 컬럼에 대하여 얼만큼의 직선의 관계가 있느냐)
df.corr()

                    age  preTestScore  postTestScore
age            1.000000     -0.105651       0.328852
preTestScore  -0.105651      1.000000       0.378039
postTestScore  0.328852      0.378039       1.000000

Data Cleaning

In [148]:
len(stock_price_DF_withIndex["저가"])

5

In [147]:
#unique() 중복된 값은 제거하고 출력
len(stock_price_DF_withIndex["저가"].unique())

4

In [149]:
#중복된 값을 가졌는지 확인하는 작업
len(stock_price_DF_withIndex["저가"].unique()) == len(stock_price_DF_withIndex["저가"])

False

In [144]:
stock_price_DF_withIndex

               시가     종가     고가    저가    GAP  Gap_forloop  Gap_forloop2
2020-03-01  10000  11000  13000  3000  10000        10000         10000
2020-03-02  10300  12000  15000  6000   9000         9000          9000
2020-03-03   9900  10000  15000  5000  10000        10000         10000
2020-03-04  10500  13000  18000  6000  12000        12000         12000
2020-03-5   11000  12000  17000  4000  13000        13000         13000

In [156]:
from numpy import nan as NA
import pandas as pd
data = pd.DataFrame([[1,6.5,3],[1,NA,NA],[NA,NA,NA],[NA,6.5,3]])
cleaned = data.dropna()

In [157]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [158]:
#axis 디폴트 값은 가로(axis=0)
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [162]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [163]:
from numpy import nan as NA
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -0.718488       NaN       NaN
1 -0.794313       NaN       NaN
2  0.642692       NaN  0.891950
3  0.875896       NaN  0.151415
4 -0.746521  1.066957 -0.552593
5  2.301313  0.900252  0.886822
6 -1.031966 -2.125358 -1.004883

In [168]:
df.dropna(thresh=2)#정상인 값 2개 이상이면 drop 시키지 말아라

          0         1         2
2  0.642692       NaN  0.891950
3  0.875896       NaN  0.151415
4 -0.746521  1.066957 -0.552593
5  2.301313  0.900252  0.886822
6 -1.031966 -2.125358 -1.004883

In [173]:
df.dropna(thresh=4, axis=1)

          0         2
0 -0.718488       NaN
1 -0.794313       NaN
2  0.642692  0.891950
3  0.875896  0.151415
4 -0.746521 -0.552593
5  2.301313  0.886822
6 -1.031966 -1.004883

In [171]:
df.fillna(1000)

          0            1            2
0 -0.718488  1000.000000  1000.000000
1 -0.794313  1000.000000  1000.000000
2  0.642692  1000.000000     0.891950
3  0.875896  1000.000000     0.151415
4 -0.746521     1.066957    -0.552593
5  2.301313     0.900252     0.886822
6 -1.031966    -2.125358    -1.004883

In [174]:
df

          0         1         2
0 -0.718488       NaN       NaN
1 -0.794313       NaN       NaN
2  0.642692       NaN  0.891950
3  0.875896       NaN  0.151415
4 -0.746521  1.066957 -0.552593
5  2.301313  0.900252  0.886822
6 -1.031966 -2.125358 -1.004883

In [175]:
#각각의 컬럼에 대해 Dictionary의 구조를 적용하여 수행
df.fillna({1:99,2:-99})

          0          1          2
0 -0.718488  99.000000 -99.000000
1 -0.794313  99.000000 -99.000000
2  0.642692  99.000000   0.891950
3  0.875896  99.000000   0.151415
4 -0.746521   1.066957  -0.552593
5  2.301313   0.900252   0.886822
6 -1.031966  -2.125358  -1.004883